soap-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tns="http://cxf.hcslearning.cl/">
    <soapenv:Header/>
    <soapenv:Body>
        <tns:decirHola>
            <nombre>Juan</nombre>
        </tns:decirHola>
    </soapenv:Body>
</soapenv:Envelope>
